; ModuleID = 'lz4frame.bc'
source_filename = "lib/lz4frame.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.LZ4F_preferences_t = type { %struct.LZ4F_frameInfo_t, i32, i32, i32, [3 x i32] }
%struct.LZ4F_frameInfo_t = type { i32, i32, i32, i32, i64, i32, i32 }
%struct.LZ4F_cctx_s = type { %struct.LZ4F_preferences_t, i32, i32, %struct.LZ4F_CDict_s*, i64, i64, i8*, i8*, i64, i64, %struct.XXH32_state_s, i8*, i16, i16 }
%struct.XXH32_state_s = type { i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32 }
%struct.LZ4F_CDict_s = type { i8*, %union.LZ4_stream_u*, %union.LZ4_streamHC_u* }
%union.LZ4_stream_u = type { [2052 x i64] }
%union.LZ4_streamHC_u = type { [32775 x i64] }
%struct.LZ4F_compressOptions_t = type { i32, [3 x i32] }
%struct.LZ4F_dctx_s = type { %struct.LZ4F_frameInfo_t, i32, i32, i64, i64, i64, i8*, i64, i64, i8*, i8*, i64, i8*, i64, i64, %struct.XXH32_state_s, %struct.XXH32_state_s, [19 x i8] }
%struct.LZ4F_decompressOptions_t = type { i32, [3 x i32] }

@LZ4F_getErrorName.codeError = internal global i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str, i32 0, i32 0), align 8, !dbg !0
@.str = private unnamed_addr constant [23 x i8] c"Unspecified error code\00", align 1

!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 481, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!18 = !DIEnumerator(name: "LZ4F_OK_NoError", value: 0)
!19 = !DIEnumerator(name: "LZ4F_ERROR_GENERIC", value: 1)
!20 = !DIEnumerator(name: "LZ4F_ERROR_maxBlockSize_invalid", value: 2)
!21 = !DIEnumerator(name: "LZ4F_ERROR_blockMode_invalid", value: 3)
!22 = !DIEnumerator(name: "LZ4F_ERROR_contentChecksumFlag_invalid", value: 4)
!23 = !DIEnumerator(name: "LZ4F_ERROR_compressionLevel_invalid", value: 5)
!24 = !DIEnumerator(name: "LZ4F_ERROR_headerVersion_wrong", value: 6)
!25 = !DIEnumerator(name: "LZ4F_ERROR_blockChecksum_invalid", value: 7)
!26 = !DIEnumerator(name: "LZ4F_ERROR_reservedFlag_set", value: 8)
!27 = !DIEnumerator(name: "LZ4F_ERROR_allocation_failed", value: 9)
!28 = !DIEnumerator(name: "LZ4F_ERROR_srcSize_tooLarge", value: 10)
!29 = !DIEnumerator(name: "LZ4F_ERROR_dstMaxSize_tooSmall", value: 11)
!30 = !DIEnumerator(name: "LZ4F_ERROR_frameHeader_incomplete", value: 12)
!31 = !DIEnumerator(name: "LZ4F_ERROR_frameType_unknown", value: 13)
!32 = !DIEnumerator(name: "LZ4F_ERROR_frameSize_wrong", value: 14)
!33 = !DIEnumerator(name: "LZ4F_ERROR_srcPtr_wrong", value: 15)
!34 = !DIEnumerator(name: "LZ4F_ERROR_decompressionFailed", value: 16)
!35 = !DIEnumerator(name: "LZ4F_ERROR_headerChecksum_invalid", value: 17)
!36 = !DIEnumerator(name: "LZ4F_ERROR_contentChecksum_invalid", value: 18)
!37 = !DIEnumerator(name: "LZ4F_ERROR_frameDecoding_alreadyStarted", value: 19)
!38 = !DIEnumerator(name: "LZ4F_ERROR_maxCode", value: 20)
!39 = !DIEnumerator(name: "_LZ4F_dummy_error_enum_for_c89_never_used", value: 21)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 114, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIEnumerator(name: "LZ4F_default", value: 0)
!43 = !DIEnumerator(name: "LZ4F_max64KB", value: 4)
!44 = !DIEnumerator(name: "LZ4F_max256KB", value: 5)
!45 = !DIEnumerator(name: "LZ4F_max1MB", value: 6)
!46 = !DIEnumerator(name: "LZ4F_max4MB", value: 7)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 129, size: 32, elements: !48)
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "LZ4F_blockLinked", value: 0)
!50 = !DIEnumerator(name: "LZ4F_blockIndependent", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 136, size: 32, elements: !52)
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "LZ4F_noContentChecksum", value: 0)
!54 = !DIEnumerator(name: "LZ4F_contentChecksumEnabled", value: 1)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 148, size: 32, elements: !56)
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "LZ4F_frame", value: 0)
!58 = !DIEnumerator(name: "LZ4F_skippableFrame", value: 1)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 143, size: 32, elements: !60)
!60 = !{!61, !62}
!61 = !DIEnumerator(name: "LZ4F_noBlockChecksum", value: 0)
!62 = !DIEnumerator(name: "LZ4F_blockChecksumEnabled", value: 1)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 801, size: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "notDone", value: 0)
!66 = !DIEnumerator(name: "fromTmpBuffer", value: 1)
!67 = !DIEnumerator(name: "fromSrcBuffer", value: 2)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1012, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!70 = !DIEnumerator(name: "dstage_getFrameHeader", value: 0)
!71 = !DIEnumerator(name: "dstage_storeFrameHeader", value: 1)
!72 = !DIEnumerator(name: "dstage_init", value: 2)
!73 = !DIEnumerator(name: "dstage_getBlockHeader", value: 3)
!74 = !DIEnumerator(name: "dstage_storeBlockHeader", value: 4)
!75 = !DIEnumerator(name: "dstage_copyDirect", value: 5)
!76 = !DIEnumerator(name: "dstage_getBlockChecksum", value: 6)
!77 = !DIEnumerator(name: "dstage_getCBlock", value: 7)
!78 = !DIEnumerator(name: "dstage_storeCBlock", value: 8)
!79 = !DIEnumerator(name: "dstage_flushOut", value: 9)
!80 = !DIEnumerator(name: "dstage_getSuffix", value: 10)
!81 = !DIEnumerator(name: "dstage_storeSuffix", value: 11)
!82 = !DIEnumerator(name: "dstage_getSFrameSize", value: 12)
!83 = !DIEnumerator(name: "dstage_storeSFrameSize", value: 13)
!84 = !DIEnumerator(name: "dstage_skipSkippable", value: 14)
!85 = !{!9, !86, !87, !88, !90, !91, !96, !11, !6, !98, !174, !238, !104, !137, !92, !121, !241, !243, !269, !187, !206, !189, !197, !191}
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_errorCodes", file: !10, line: 482, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !12, line: 51, baseType: !89)
!89 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BYTE", file: !3, line: 122, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !94, line: 48, baseType: !95)
!94 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/klee/lz4")
!95 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "U64", file: !3, line: 126, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !94, line: 55, baseType: !13)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_CDict", file: !10, line: 491, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LZ4F_CDict_s", file: !3, line: 467, size: 192, elements: !101)
!101 = !{!102, !103, !136}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dictContent", scope: !100, file: !3, line: 468, baseType: !90, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "fastCtx", scope: !100, file: !3, line: 469, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4_stream_t", file: !106, line: 257, baseType: !107)
!106 = !DIFile(filename: "lib/lz4.h", directory: "/home/klee/lz4")
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "LZ4_stream_u", file: !106, line: 563, size: 131328, elements: !108)
!108 = !{!109, !114}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !107, file: !106, line: 564, baseType: !110, size: 131328)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 131328, elements: !112)
!111 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !{!113}
!113 = !DISubrange(count: 2052)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "internal_donotuse", scope: !107, file: !106, line: 565, baseType: !115, size: 131328)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4_stream_t_internal", file: !106, line: 514, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LZ4_stream_t_internal", file: !106, line: 515, size: 131328, elements: !117)
!117 = !{!118, !124, !125, !128, !129, !132, !135}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "hashTable", scope: !116, file: !106, line: 516, baseType: !119, size: 131072)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 131072, elements: !122)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !94, line: 51, baseType: !121)
!121 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!122 = !{!123}
!123 = !DISubrange(count: 4096)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "currentOffset", scope: !116, file: !106, line: 517, baseType: !120, size: 32, offset: 131072)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !116, file: !106, line: 518, baseType: !126, size: 16, offset: 131104)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !94, line: 49, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tableType", scope: !116, file: !106, line: 519, baseType: !126, size: 16, offset: 131120)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dictionary", scope: !116, file: !106, line: 520, baseType: !130, size: 64, offset: 131136)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dictCtx", scope: !116, file: !106, line: 521, baseType: !133, size: 64, offset: 131200)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dictSize", scope: !116, file: !106, line: 522, baseType: !120, size: 32, offset: 131264)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "HCCtx", scope: !100, file: !3, line: 470, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4_streamHC_t", file: !139, line: 101, baseType: !140)
!139 = !DIFile(filename: "lib/lz4hc.h", directory: "/home/klee/lz4")
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "LZ4_streamHC_u", file: !139, line: 246, size: 2097600, elements: !141)
!141 = !{!142, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !140, file: !139, line: 247, baseType: !143, size: 2097600)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2097600, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 32775)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "internal_donotuse", scope: !140, file: !139, line: 248, baseType: !147, size: 2097536)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4HC_CCtx_internal", file: !139, line: 201, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LZ4HC_CCtx_internal", file: !139, line: 202, size: 2097536, elements: !149)
!149 = !{!150, !154, !158, !159, !160, !161, !162, !163, !164, !166, !170, !171}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "hashTable", scope: !148, file: !139, line: 204, baseType: !151, size: 1048576)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 1048576, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 32768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "chainTable", scope: !148, file: !139, line: 205, baseType: !155, size: 1048576, offset: 1048576)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1048576, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 65536)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !148, file: !139, line: 206, baseType: !130, size: 64, offset: 2097152)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !148, file: !139, line: 207, baseType: !130, size: 64, offset: 2097216)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dictBase", scope: !148, file: !139, line: 208, baseType: !130, size: 64, offset: 2097280)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "dictLimit", scope: !148, file: !139, line: 209, baseType: !120, size: 32, offset: 2097344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "lowLimit", scope: !148, file: !139, line: 210, baseType: !120, size: 32, offset: 2097376)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nextToUpdate", scope: !148, file: !139, line: 211, baseType: !120, size: 32, offset: 2097408)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "compressionLevel", scope: !148, file: !139, line: 212, baseType: !165, size: 16, offset: 2097440)
!165 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "favorDecSpeed", scope: !148, file: !139, line: 213, baseType: !167, size: 8, offset: 2097456)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !168, line: 194, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/klee/lz4")
!169 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !148, file: !139, line: 215, baseType: !167, size: 8, offset: 2097464)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dictCtx", scope: !148, file: !139, line: 216, baseType: !172, size: 64, offset: 2097472)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_cctx_t", file: !3, line: 229, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LZ4F_cctx_s", file: !3, line: 213, size: 1472, elements: !177)
!177 = !{!178, !205, !207, !208, !211, !212, !213, !214, !215, !216, !217, !234, !235, !237}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prefs", scope: !176, file: !3, line: 215, baseType: !179, size: 448)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_preferences_t", file: !10, line: 189, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 183, size: 448, elements: !181)
!181 = !{!182, !198, !199, !200, !201}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "frameInfo", scope: !180, file: !10, line: 184, baseType: !183, size: 256)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_frameInfo_t", file: !10, line: 174, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 166, size: 256, elements: !185)
!185 = !{!186, !188, !190, !192, !194, !195, !196}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "blockSizeID", scope: !184, file: !10, line: 167, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_blockSizeID_t", file: !10, line: 124, baseType: !40)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "blockMode", scope: !184, file: !10, line: 168, baseType: !189, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_blockMode_t", file: !10, line: 134, baseType: !47)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "contentChecksumFlag", scope: !184, file: !10, line: 169, baseType: !191, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_contentChecksum_t", file: !10, line: 141, baseType: !51)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "frameType", scope: !184, file: !10, line: 170, baseType: !193, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_frameType_t", file: !10, line: 152, baseType: !55)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "contentSize", scope: !184, file: !10, line: 171, baseType: !111, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dictID", scope: !184, file: !10, line: 172, baseType: !121, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "blockChecksumFlag", scope: !184, file: !10, line: 173, baseType: !197, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_blockChecksum_t", file: !10, line: 146, baseType: !59)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "compressionLevel", scope: !180, file: !10, line: 185, baseType: !86, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "autoFlush", scope: !180, file: !10, line: 186, baseType: !121, size: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "favorDecSpeed", scope: !180, file: !10, line: 187, baseType: !121, size: 32, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !180, file: !10, line: 188, baseType: !202, size: 96, offset: 352)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 96, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 3)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !176, file: !3, line: 216, baseType: !206, size: 32, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !3, line: 124, baseType: !120)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cStage", scope: !176, file: !3, line: 217, baseType: !206, size: 32, offset: 480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cdict", scope: !176, file: !3, line: 218, baseType: !209, size: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "maxBlockSize", scope: !176, file: !3, line: 219, baseType: !11, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "maxBufferSize", scope: !176, file: !3, line: 220, baseType: !11, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tmpBuff", scope: !176, file: !3, line: 221, baseType: !91, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tmpIn", scope: !176, file: !3, line: 222, baseType: !91, size: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tmpInSize", scope: !176, file: !3, line: 223, baseType: !11, size: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "totalInSize", scope: !176, file: !3, line: 224, baseType: !96, size: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xxh", scope: !176, file: !3, line: 225, baseType: !218, size: 384, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "XXH32_state_t", file: !219, line: 172, baseType: !220)
!219 = !DIFile(filename: "lib/xxhash.h", directory: "/home/klee/lz4")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XXH32_state_s", file: !219, line: 264, size: 384, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !232, !233}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "total_len_32", scope: !220, file: !219, line: 265, baseType: !120, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "large_len", scope: !220, file: !219, line: 266, baseType: !120, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !220, file: !219, line: 267, baseType: !120, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !220, file: !219, line: 268, baseType: !120, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !220, file: !219, line: 269, baseType: !120, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !220, file: !219, line: 270, baseType: !120, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mem32", scope: !220, file: !219, line: 271, baseType: !229, size: 128, offset: 192)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 4)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "memsize", scope: !220, file: !219, line: 272, baseType: !120, size: 32, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !220, file: !219, line: 273, baseType: !120, size: 32, offset: 352)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lz4CtxPtr", scope: !176, file: !3, line: 226, baseType: !90, size: 64, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lz4CtxAlloc", scope: !176, file: !3, line: 227, baseType: !236, size: 16, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "U16", file: !3, line: 123, baseType: !126)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lz4CtxState", scope: !176, file: !3, line: 228, baseType: !236, size: 16, offset: 1424)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_compressionContext_t", file: !10, line: 224, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_cctx", file: !10, line: 223, baseType: !176)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_dctx", file: !10, line: 327, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LZ4F_dctx_s", file: !3, line: 1024, size: 2048, elements: !246)
!246 = !{!247, !248, !249, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "frameInfo", scope: !245, file: !3, line: 1025, baseType: !183, size: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !245, file: !3, line: 1026, baseType: !206, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dStage", scope: !245, file: !3, line: 1027, baseType: !250, size: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "dStage_t", file: !3, line: 1022, baseType: !68)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "frameRemainingSize", scope: !245, file: !3, line: 1028, baseType: !96, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "maxBlockSize", scope: !245, file: !3, line: 1029, baseType: !11, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "maxBufferSize", scope: !245, file: !3, line: 1030, baseType: !11, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tmpIn", scope: !245, file: !3, line: 1031, baseType: !91, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tmpInSize", scope: !245, file: !3, line: 1032, baseType: !11, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tmpInTarget", scope: !245, file: !3, line: 1033, baseType: !11, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tmpOutBuffer", scope: !245, file: !3, line: 1034, baseType: !91, size: 64, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !245, file: !3, line: 1035, baseType: !241, size: 64, offset: 768)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dictSize", scope: !245, file: !3, line: 1036, baseType: !11, size: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tmpOut", scope: !245, file: !3, line: 1037, baseType: !91, size: 64, offset: 896)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tmpOutSize", scope: !245, file: !3, line: 1038, baseType: !11, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tmpOutStart", scope: !245, file: !3, line: 1039, baseType: !11, size: 64, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xxh", scope: !245, file: !3, line: 1040, baseType: !218, size: 384, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "blockChecksum", scope: !245, file: !3, line: 1041, baseType: !218, size: 384, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !245, file: !3, line: 1042, baseType: !266, size: 152, offset: 1856)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 152, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 19)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!270 = !{!0, !271, !279, !281, !283, !285, !287}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "blockSizes", scope: !273, file: !3, line: 270, type: !277, isLocal: true, isDefinition: true)
!273 = distinct !DISubprogram(name: "LZ4F_getBlockSize", scope: !3, file: !3, line: 268, type: !274, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!274 = !DISubroutineType(types: !275)
!275 = !{!11, !121}
!276 = !{}
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !230)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression(DW_OP_constu, 19, DW_OP_stack_value))
!280 = distinct !DIGlobalVariable(name: "maxFHSize", scope: !14, file: !3, line: 205, type: !278, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!282 = distinct !DIGlobalVariable(name: "BHSize", scope: !14, file: !3, line: 206, type: !278, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!284 = distinct !DIGlobalVariable(name: "BFSize", scope: !14, file: !3, line: 207, type: !278, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression(DW_OP_constu, 7, DW_OP_stack_value))
!286 = distinct !DIGlobalVariable(name: "minFHSize", scope: !14, file: !3, line: 204, type: !278, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "LZ4F_errorStrings", scope: !14, file: !3, line: 236, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1344, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 21)
!292 = distinct !DICompileUnit(language: DW_LANG_C89, file: !293, producer: "clang version 6.0.0-1ubuntu2~16.04.1 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !276)
!293 = !DIFile(filename: "/tmp/klee_src/runtime/FreeStanding/memcpy.c", directory: "/tmp/klee_build60stp_z3/runtime/FreeStanding")
!294 = distinct !DICompileUnit(language: DW_LANG_C89, file: !295, producer: "clang version 6.0.0-1ubuntu2~16.04.1 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !276)
!295 = !DIFile(filename: "/tmp/klee_src/runtime/FreeStanding/memset.c", directory: "/tmp/klee_build60stp_z3/runtime/FreeStanding")
!296 = distinct !DICompileUnit(language: DW_LANG_C89, file: !297, producer: "clang version 6.0.0-1ubuntu2~16.04.1 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !276)
!297 = !DIFile(filename: "/tmp/klee_src/runtime/Intrinsic/klee_div_zero_check.c", directory: "/tmp/klee_build60stp_z3/runtime/Intrinsic")
!298 = !{i32 2, !"Dwarf Version", i32 4}
!299 = !{i32 2, !"Debug Info Version", i32 3}
!300 = !{i32 1, !"wchar_size", i32 4}
!301 = !{!"clang version 6.0.1 (branches/release_60 355598)"}
!302 = !{!"clang version 6.0.0-1ubuntu2~16.04.1 (tags/RELEASE_600/final)"}
!303 = distinct !DISubprogram(name: "LZ4F_isError", scope: !3, file: !3, line: 239, type: !304, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!304 = !DISubroutineType(types: !305)
!305 = !{!121, !9}
!306 = !DILocation(line: 241, column: 13, scope: !303)
!307 = !DILocation(line: 241, column: 18, scope: !303)
!308 = !DILocation(line: 241, column: 5, scope: !303)
!309 = !DILocation(line: 247, column: 22, scope: !310)
!310 = distinct !DILexicalBlock(scope: !2, file: !3, line: 247, column: 9)
!311 = !DILocation(line: 247, column: 9, scope: !310)
!312 = !DILocation(line: 247, column: 9, scope: !2)
!313 = !DILocation(line: 247, column: 61, scope: !310)
!314 = !DILocation(line: 247, column: 55, scope: !310)
!315 = !DILocation(line: 247, column: 54, scope: !310)
!316 = !DILocation(line: 247, column: 36, scope: !310)
!317 = !DILocation(line: 247, column: 29, scope: !310)
!318 = !DILocation(line: 248, column: 12, scope: !2)
!319 = !DILocation(line: 248, column: 5, scope: !2)
!320 = !DILocation(line: 249, column: 1, scope: !2)
!321 = distinct !DISubprogram(name: "LZ4F_getErrorCode", scope: !3, file: !3, line: 251, type: !322, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!322 = !DISubroutineType(types: !323)
!323 = !{!87, !11}
!324 = !DILocation(line: 253, column: 23, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !3, line: 253, column: 9)
!326 = !DILocation(line: 253, column: 10, scope: !325)
!327 = !DILocation(line: 253, column: 9, scope: !321)
!328 = !DILocation(line: 253, column: 40, scope: !325)
!329 = !DILocation(line: 254, column: 42, scope: !321)
!330 = !DILocation(line: 254, column: 30, scope: !321)
!331 = !DILocation(line: 254, column: 12, scope: !321)
!332 = !DILocation(line: 254, column: 5, scope: !321)
!333 = !DILocation(line: 255, column: 1, scope: !321)
!334 = distinct !DISubprogram(name: "LZ4F_getVersion", scope: !3, file: !3, line: 264, type: !335, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!335 = !DISubroutineType(types: !336)
!336 = !{!121}
!337 = !DILocation(line: 264, column: 34, scope: !334)
!338 = distinct !DISubprogram(name: "LZ4F_compressionLevel_max", scope: !3, file: !3, line: 266, type: !339, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!339 = !DISubroutineType(types: !340)
!340 = !{!86}
!341 = !DILocation(line: 266, column: 39, scope: !338)
!342 = !DILocation(line: 272, column: 9, scope: !343)
!343 = distinct !DILexicalBlock(scope: !273, file: !3, line: 272, column: 9)
!344 = !DILocation(line: 272, column: 21, scope: !343)
!345 = !DILocation(line: 272, column: 9, scope: !273)
!346 = !DILocation(line: 272, column: 39, scope: !343)
!347 = !DILocation(line: 272, column: 27, scope: !343)
!348 = !DILocation(line: 273, column: 9, scope: !349)
!349 = distinct !DILexicalBlock(scope: !273, file: !3, line: 273, column: 9)
!350 = !DILocation(line: 273, column: 21, scope: !349)
!351 = !DILocation(line: 273, column: 25, scope: !349)
!352 = !DILocation(line: 273, column: 28, scope: !349)
!353 = !DILocation(line: 273, column: 40, scope: !349)
!354 = !DILocation(line: 273, column: 9, scope: !273)
!355 = !DILocation(line: 273, column: 52, scope: !349)
!356 = !DILocation(line: 273, column: 45, scope: !349)
!357 = !DILocation(line: 274, column: 17, scope: !273)
!358 = !DILocation(line: 275, column: 23, scope: !273)
!359 = !DILocation(line: 275, column: 12, scope: !273)
!360 = !DILocation(line: 275, column: 5, scope: !273)
!361 = !DILocation(line: 276, column: 1, scope: !273)
!362 = distinct !DISubprogram(name: "err0r", scope: !3, file: !3, line: 257, type: !363, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!363 = !DISubroutineType(types: !364)
!364 = !{!9, !87}
!365 = !DILocation(line: 261, column: 42, scope: !362)
!366 = !DILocation(line: 261, column: 31, scope: !362)
!367 = !DILocation(line: 261, column: 30, scope: !362)
!368 = !DILocation(line: 261, column: 5, scope: !362)
!369 = distinct !DISubprogram(name: "LZ4F_compressFrameBound", scope: !3, file: !3, line: 340, type: !370, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!370 = !DISubroutineType(types: !371)
!371 = !{!11, !11, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!374 = !DILocation(line: 343, column: 18, scope: !369)
!375 = !DILocation(line: 345, column: 9, scope: !376)
!376 = distinct !DILexicalBlock(scope: !369, file: !3, line: 345, column: 9)
!377 = !DILocation(line: 345, column: 23, scope: !376)
!378 = !DILocation(line: 345, column: 9, scope: !369)
!379 = !DILocation(line: 345, column: 40, scope: !376)
!380 = !DILocation(line: 345, column: 39, scope: !376)
!381 = !DILocation(line: 345, column: 31, scope: !376)
!382 = !DILocation(line: 346, column: 10, scope: !376)
!383 = !DILocation(line: 347, column: 11, scope: !369)
!384 = !DILocation(line: 347, column: 21, scope: !369)
!385 = !DILocation(line: 349, column: 53, scope: !369)
!386 = !DILocation(line: 349, column: 25, scope: !369)
!387 = !DILocation(line: 349, column: 23, scope: !369)
!388 = !DILocation(line: 349, column: 5, scope: !369)
!389 = distinct !DISubprogram(name: "LZ4F_compressBound_internal", scope: !3, file: !3, line: 313, type: !390, isLocal: true, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!390 = !DISubroutineType(types: !391)
!391 = !{!11, !11, !372, !11}
!392 = !DILocation(line: 318, column: 5, scope: !389)
!393 = !DILocation(line: 319, column: 15, scope: !389)
!394 = !DILocation(line: 319, column: 25, scope: !389)
!395 = !DILocation(line: 319, column: 45, scope: !389)
!396 = !DILocation(line: 320, column: 53, scope: !397)
!397 = distinct !DILexicalBlock(scope: !389, file: !3, line: 320, column: 5)
!398 = !DILocation(line: 320, column: 67, scope: !397)
!399 = !DILocation(line: 320, column: 52, scope: !397)
!400 = !DILocation(line: 320, column: 90, scope: !397)
!401 = !DILocation(line: 320, column: 41, scope: !397)
!402 = !DILocation(line: 321, column: 27, scope: !397)
!403 = !DILocation(line: 321, column: 37, scope: !397)
!404 = !DILocation(line: 321, column: 50, scope: !397)
!405 = !DILocation(line: 321, column: 57, scope: !397)
!406 = !DILocation(line: 321, column: 47, scope: !397)
!407 = !DILocation(line: 321, column: 19, scope: !397)
!408 = !DILocation(line: 322, column: 44, scope: !397)
!409 = !DILocation(line: 322, column: 54, scope: !397)
!410 = !DILocation(line: 322, column: 64, scope: !397)
!411 = !DILocation(line: 322, column: 34, scope: !397)
!412 = !DILocation(line: 323, column: 52, scope: !397)
!413 = !DILocation(line: 323, column: 34, scope: !397)
!414 = !DILocation(line: 323, column: 22, scope: !397)
!415 = !DILocation(line: 324, column: 36, scope: !397)
!416 = !DILocation(line: 324, column: 46, scope: !397)
!417 = !DILocation(line: 324, column: 22, scope: !397)
!418 = !DILocation(line: 325, column: 37, scope: !397)
!419 = !DILocation(line: 325, column: 22, scope: !397)
!420 = !DILocation(line: 326, column: 35, scope: !397)
!421 = !DILocation(line: 326, column: 45, scope: !397)
!422 = !DILocation(line: 326, column: 43, scope: !397)
!423 = !DILocation(line: 326, column: 22, scope: !397)
!424 = !DILocation(line: 327, column: 50, scope: !397)
!425 = !DILocation(line: 327, column: 63, scope: !397)
!426 = !DILocation(line: 327, column: 61, scope: !397)
!427 = !{!"True"}
!428 = !DILocation(line: 327, column: 39, scope: !397)
!429 = !DILocation(line: 327, column: 24, scope: !397)
!430 = !DILocation(line: 328, column: 41, scope: !397)
!431 = !DILocation(line: 328, column: 55, scope: !397)
!432 = !DILocation(line: 328, column: 64, scope: !397)
!433 = !DILocation(line: 328, column: 52, scope: !397)
!434 = !DILocation(line: 328, column: 22, scope: !397)
!435 = !DILocation(line: 329, column: 38, scope: !397)
!436 = !DILocation(line: 329, column: 46, scope: !397)
!437 = !DILocation(line: 329, column: 22, scope: !397)
!438 = !DILocation(line: 330, column: 35, scope: !397)
!439 = !DILocation(line: 330, column: 51, scope: !397)
!440 = !DILocation(line: 330, column: 64, scope: !397)
!441 = !DILocation(line: 330, column: 48, scope: !397)
!442 = !DILocation(line: 330, column: 24, scope: !397)
!443 = !DILocation(line: 332, column: 46, scope: !397)
!444 = !DILocation(line: 332, column: 56, scope: !397)
!445 = !DILocation(line: 332, column: 66, scope: !397)
!446 = !DILocation(line: 332, column: 44, scope: !397)
!447 = !DILocation(line: 332, column: 22, scope: !397)
!448 = !DILocation(line: 333, column: 43, scope: !397)
!449 = !DILocation(line: 333, column: 53, scope: !397)
!450 = !DILocation(line: 333, column: 63, scope: !397)
!451 = !DILocation(line: 333, column: 82, scope: !397)
!452 = !DILocation(line: 333, column: 40, scope: !397)
!453 = !DILocation(line: 333, column: 22, scope: !397)
!454 = !DILocation(line: 335, column: 27, scope: !397)
!455 = !DILocation(line: 335, column: 25, scope: !397)
!456 = !DILocation(line: 335, column: 43, scope: !397)
!457 = !DILocation(line: 335, column: 41, scope: !397)
!458 = !DILocation(line: 336, column: 17, scope: !397)
!459 = !DILocation(line: 336, column: 29, scope: !397)
!460 = !DILocation(line: 336, column: 27, scope: !397)
!461 = !DILocation(line: 335, column: 53, scope: !397)
!462 = !DILocation(line: 336, column: 45, scope: !397)
!463 = !DILocation(line: 336, column: 43, scope: !397)
!464 = !DILocation(line: 336, column: 61, scope: !397)
!465 = !DILocation(line: 336, column: 59, scope: !397)
!466 = !DILocation(line: 335, column: 9, scope: !397)
!467 = distinct !DISubprogram(name: "LZ4F_compressFrame_usingCDict", scope: !3, file: !3, line: 362, type: !468, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!468 = !DISubroutineType(types: !469)
!469 = !{!11, !239, !90, !11, !470, !11, !209, !372}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!472 = !DILocation(line: 370, column: 36, scope: !467)
!473 = !DILocation(line: 370, column: 17, scope: !467)
!474 = !DILocation(line: 371, column: 20, scope: !467)
!475 = !DILocation(line: 371, column: 11, scope: !467)
!476 = !DILocation(line: 372, column: 26, scope: !467)
!477 = !DILocation(line: 372, column: 37, scope: !467)
!478 = !DILocation(line: 372, column: 35, scope: !467)
!479 = !DILocation(line: 372, column: 17, scope: !467)
!480 = !DILocation(line: 374, column: 9, scope: !481)
!481 = distinct !DILexicalBlock(scope: !467, file: !3, line: 374, column: 9)
!482 = !DILocation(line: 374, column: 23, scope: !481)
!483 = !DILocation(line: 374, column: 9, scope: !467)
!484 = !DILocation(line: 375, column: 18, scope: !481)
!485 = !DILocation(line: 375, column: 17, scope: !481)
!486 = !DILocation(line: 375, column: 9, scope: !481)
!487 = !DILocation(line: 377, column: 9, scope: !481)
!488 = !DILocation(line: 378, column: 15, scope: !489)
!489 = distinct !DILexicalBlock(scope: !467, file: !3, line: 378, column: 9)
!490 = !DILocation(line: 378, column: 25, scope: !489)
!491 = !DILocation(line: 378, column: 37, scope: !489)
!492 = !DILocation(line: 378, column: 9, scope: !467)
!493 = !DILocation(line: 379, column: 44, scope: !489)
!494 = !DILocation(line: 379, column: 15, scope: !489)
!495 = !DILocation(line: 379, column: 25, scope: !489)
!496 = !DILocation(line: 379, column: 37, scope: !489)
!497 = !DILocation(line: 379, column: 9, scope: !489)
!498 = !DILocation(line: 381, column: 58, scope: !467)
!499 = !DILocation(line: 381, column: 68, scope: !467)
!500 = !DILocation(line: 381, column: 81, scope: !467)
!501 = !DILocation(line: 381, column: 35, scope: !467)
!502 = !DILocation(line: 381, column: 11, scope: !467)
!503 = !DILocation(line: 381, column: 21, scope: !467)
!504 = !DILocation(line: 381, column: 33, scope: !467)
!505 = !DILocation(line: 382, column: 11, scope: !467)
!506 = !DILocation(line: 382, column: 21, scope: !467)
!507 = !DILocation(line: 383, column: 9, scope: !508)
!508 = distinct !DILexicalBlock(scope: !467, file: !3, line: 383, column: 9)
!509 = !DILocation(line: 383, column: 44, scope: !508)
!510 = !DILocation(line: 383, column: 54, scope: !508)
!511 = !DILocation(line: 383, column: 20, scope: !508)
!512 = !DILocation(line: 383, column: 17, scope: !508)
!513 = !DILocation(line: 383, column: 9, scope: !467)
!514 = !DILocation(line: 384, column: 15, scope: !508)
!515 = !DILocation(line: 384, column: 25, scope: !508)
!516 = !DILocation(line: 384, column: 35, scope: !508)
!517 = !DILocation(line: 384, column: 9, scope: !508)
!518 = !DILocation(line: 386, column: 5, scope: !467)
!519 = !DILocation(line: 387, column: 13, scope: !467)
!520 = !DILocation(line: 387, column: 23, scope: !467)
!521 = !DILocation(line: 389, column: 9, scope: !522)
!522 = distinct !DILexicalBlock(scope: !467, file: !3, line: 389, column: 9)
!523 = !DILocation(line: 389, column: 47, scope: !522)
!524 = !DILocation(line: 389, column: 23, scope: !522)
!525 = !DILocation(line: 389, column: 21, scope: !522)
!526 = !DILocation(line: 389, column: 9, scope: !467)
!527 = !DILocation(line: 390, column: 16, scope: !522)
!528 = !DILocation(line: 390, column: 9, scope: !522)
!529 = !DILocation(line: 392, column: 63, scope: !530)
!530 = distinct !DILexicalBlock(scope: !467, file: !3, line: 392, column: 5)
!531 = !DILocation(line: 392, column: 69, scope: !530)
!532 = !DILocation(line: 392, column: 80, scope: !530)
!533 = !DILocation(line: 392, column: 93, scope: !530)
!534 = !DILocation(line: 392, column: 33, scope: !530)
!535 = !DILocation(line: 392, column: 20, scope: !530)
!536 = !DILocation(line: 393, column: 24, scope: !537)
!537 = distinct !DILexicalBlock(scope: !530, file: !3, line: 393, column: 11)
!538 = !DILocation(line: 393, column: 11, scope: !537)
!539 = !DILocation(line: 393, column: 11, scope: !530)
!540 = !DILocation(line: 393, column: 44, scope: !537)
!541 = !DILocation(line: 393, column: 37, scope: !537)
!542 = !DILocation(line: 394, column: 17, scope: !530)
!543 = !DILocation(line: 394, column: 14, scope: !530)
!544 = !DILocation(line: 397, column: 48, scope: !545)
!545 = distinct !DILexicalBlock(scope: !467, file: !3, line: 397, column: 5)
!546 = !DILocation(line: 397, column: 54, scope: !545)
!547 = !DILocation(line: 397, column: 71, scope: !545)
!548 = !DILocation(line: 397, column: 78, scope: !545)
!549 = !DILocation(line: 397, column: 77, scope: !545)
!550 = !DILocation(line: 397, column: 87, scope: !545)
!551 = !DILocation(line: 397, column: 98, scope: !545)
!552 = !DILocation(line: 397, column: 28, scope: !545)
!553 = !DILocation(line: 397, column: 20, scope: !545)
!554 = !DILocation(line: 398, column: 24, scope: !555)
!555 = distinct !DILexicalBlock(scope: !545, file: !3, line: 398, column: 11)
!556 = !DILocation(line: 398, column: 11, scope: !555)
!557 = !DILocation(line: 398, column: 11, scope: !545)
!558 = !DILocation(line: 398, column: 39, scope: !555)
!559 = !DILocation(line: 398, column: 32, scope: !555)
!560 = !DILocation(line: 399, column: 17, scope: !545)
!561 = !DILocation(line: 399, column: 14, scope: !545)
!562 = !DILocation(line: 402, column: 48, scope: !563)
!563 = distinct !DILexicalBlock(scope: !467, file: !3, line: 402, column: 5)
!564 = !DILocation(line: 402, column: 54, scope: !563)
!565 = !DILocation(line: 402, column: 71, scope: !563)
!566 = !DILocation(line: 402, column: 78, scope: !563)
!567 = !DILocation(line: 402, column: 77, scope: !563)
!568 = !DILocation(line: 402, column: 31, scope: !563)
!569 = !DILocation(line: 402, column: 20, scope: !563)
!570 = !DILocation(line: 403, column: 24, scope: !571)
!571 = distinct !DILexicalBlock(scope: !563, file: !3, line: 403, column: 11)
!572 = !DILocation(line: 403, column: 11, scope: !571)
!573 = !DILocation(line: 403, column: 11, scope: !563)
!574 = !DILocation(line: 403, column: 42, scope: !571)
!575 = !DILocation(line: 403, column: 35, scope: !571)
!576 = !DILocation(line: 404, column: 17, scope: !563)
!577 = !DILocation(line: 404, column: 14, scope: !563)
!578 = !DILocation(line: 407, column: 21, scope: !467)
!579 = !DILocation(line: 407, column: 30, scope: !467)
!580 = !DILocation(line: 407, column: 28, scope: !467)
!581 = !DILocation(line: 407, column: 5, scope: !467)
!582 = !DILocation(line: 408, column: 1, scope: !467)
!583 = distinct !DISubprogram(name: "LZ4F_optimalBSID", scope: !3, file: !3, line: 293, type: !584, isLocal: true, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!584 = !DISubroutineType(types: !585)
!585 = !{!187, !586, !278}
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!587 = !DILocation(line: 296, column: 24, scope: !583)
!588 = !DILocation(line: 297, column: 12, scope: !583)
!589 = !DILocation(line: 298, column: 5, scope: !583)
!590 = !DILocation(line: 298, column: 12, scope: !583)
!591 = !DILocation(line: 298, column: 28, scope: !583)
!592 = !DILocation(line: 298, column: 26, scope: !583)
!593 = !DILocation(line: 299, column: 13, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !3, line: 299, column: 13)
!595 = distinct !DILexicalBlock(scope: !583, file: !3, line: 298, column: 42)
!596 = !DILocation(line: 299, column: 24, scope: !594)
!597 = !DILocation(line: 299, column: 21, scope: !594)
!598 = !DILocation(line: 299, column: 13, scope: !595)
!599 = !DILocation(line: 300, column: 20, scope: !594)
!600 = !DILocation(line: 300, column: 13, scope: !594)
!601 = !DILocation(line: 301, column: 50, scope: !595)
!602 = !DILocation(line: 301, column: 63, scope: !595)
!603 = !DILocation(line: 301, column: 22, scope: !595)
!604 = !DILocation(line: 302, column: 22, scope: !595)
!605 = distinct !{!605, !589, !606}
!606 = !DILocation(line: 303, column: 5, scope: !583)
!607 = !DILocation(line: 304, column: 12, scope: !583)
!608 = !DILocation(line: 304, column: 5, scope: !583)
!609 = !DILocation(line: 305, column: 1, scope: !583)
!610 = distinct !DISubprogram(name: "LZ4F_compressBegin_usingCDict", scope: !3, file: !3, line: 589, type: !611, isLocal: false, isDefinition: true, scopeLine: 593, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!611 = !DISubroutineType(types: !612)
!612 = !{!11, !239, !90, !11, !209, !372}
!613 = !DILocation(line: 595, column: 35, scope: !610)
!614 = !DILocation(line: 595, column: 17, scope: !610)
!615 = !DILocation(line: 596, column: 20, scope: !610)
!616 = !DILocation(line: 596, column: 11, scope: !610)
!617 = !DILocation(line: 599, column: 9, scope: !618)
!618 = distinct !DILexicalBlock(scope: !610, file: !3, line: 599, column: 9)
!619 = !DILocation(line: 599, column: 21, scope: !618)
!620 = !DILocation(line: 599, column: 9, scope: !610)
!621 = !DILocation(line: 599, column: 41, scope: !618)
!622 = !DILocation(line: 599, column: 34, scope: !618)
!623 = !DILocation(line: 600, column: 5, scope: !610)
!624 = !DILocation(line: 601, column: 9, scope: !625)
!625 = distinct !DILexicalBlock(scope: !610, file: !3, line: 601, column: 9)
!626 = !DILocation(line: 601, column: 24, scope: !625)
!627 = !DILocation(line: 601, column: 9, scope: !610)
!628 = !DILocation(line: 601, column: 48, scope: !625)
!629 = !DILocation(line: 601, column: 33, scope: !625)
!630 = !DILocation(line: 602, column: 5, scope: !610)
!631 = !DILocation(line: 602, column: 14, scope: !610)
!632 = !DILocation(line: 602, column: 23, scope: !610)
!633 = !DILocation(line: 602, column: 22, scope: !610)
!634 = !DILocation(line: 605, column: 32, scope: !635)
!635 = distinct !DILexicalBlock(scope: !610, file: !3, line: 605, column: 5)
!636 = !DILocation(line: 605, column: 41, scope: !635)
!637 = !DILocation(line: 605, column: 47, scope: !635)
!638 = !DILocation(line: 605, column: 64, scope: !635)
!639 = !DILocation(line: 605, column: 31, scope: !635)
!640 = !DILocation(line: 605, column: 19, scope: !635)
!641 = !DILocation(line: 606, column: 13, scope: !642)
!642 = distinct !DILexicalBlock(scope: !635, file: !3, line: 606, column: 13)
!643 = !DILocation(line: 606, column: 22, scope: !642)
!644 = !DILocation(line: 606, column: 36, scope: !642)
!645 = !DILocation(line: 606, column: 34, scope: !642)
!646 = !DILocation(line: 606, column: 13, scope: !635)
!647 = !DILocation(line: 607, column: 13, scope: !648)
!648 = distinct !DILexicalBlock(scope: !642, file: !3, line: 606, column: 47)
!649 = !DILocation(line: 608, column: 17, scope: !650)
!650 = distinct !DILexicalBlock(scope: !648, file: !3, line: 608, column: 17)
!651 = !DILocation(line: 608, column: 26, scope: !650)
!652 = !DILocation(line: 608, column: 32, scope: !650)
!653 = !DILocation(line: 608, column: 49, scope: !650)
!654 = !DILocation(line: 608, column: 17, scope: !648)
!655 = !DILocation(line: 609, column: 45, scope: !656)
!656 = distinct !DILexicalBlock(scope: !650, file: !3, line: 608, column: 69)
!657 = !DILocation(line: 609, column: 38, scope: !656)
!658 = !DILocation(line: 609, column: 17, scope: !656)
!659 = !DILocation(line: 609, column: 26, scope: !656)
!660 = !DILocation(line: 609, column: 36, scope: !656)
!661 = !DILocation(line: 610, column: 13, scope: !656)
!662 = !DILocation(line: 611, column: 45, scope: !663)
!663 = distinct !DILexicalBlock(scope: !650, file: !3, line: 610, column: 20)
!664 = !DILocation(line: 611, column: 38, scope: !663)
!665 = !DILocation(line: 611, column: 17, scope: !663)
!666 = !DILocation(line: 611, column: 26, scope: !663)
!667 = !DILocation(line: 611, column: 36, scope: !663)
!668 = !DILocation(line: 613, column: 17, scope: !669)
!669 = distinct !DILexicalBlock(scope: !648, file: !3, line: 613, column: 17)
!670 = !DILocation(line: 613, column: 26, scope: !669)
!671 = !DILocation(line: 613, column: 36, scope: !669)
!672 = !DILocation(line: 613, column: 17, scope: !648)
!673 = !DILocation(line: 613, column: 52, scope: !669)
!674 = !DILocation(line: 613, column: 45, scope: !669)
!675 = !DILocation(line: 614, column: 36, scope: !648)
!676 = !DILocation(line: 614, column: 13, scope: !648)
!677 = !DILocation(line: 614, column: 22, scope: !648)
!678 = !DILocation(line: 614, column: 34, scope: !648)
!679 = !DILocation(line: 615, column: 36, scope: !648)
!680 = !DILocation(line: 615, column: 13, scope: !648)
!681 = !DILocation(line: 615, column: 22, scope: !648)
!682 = !DILocation(line: 615, column: 34, scope: !648)
!683 = !DILocation(line: 616, column: 9, scope: !648)
!684 = !DILocation(line: 616, column: 20, scope: !685)
!685 = distinct !DILexicalBlock(scope: !642, file: !3, line: 616, column: 20)
!686 = !DILocation(line: 616, column: 29, scope: !685)
!687 = !DILocation(line: 616, column: 44, scope: !685)
!688 = !DILocation(line: 616, column: 41, scope: !685)
!689 = !DILocation(line: 616, column: 20, scope: !642)
!690 = !DILocation(line: 619, column: 17, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !3, line: 619, column: 17)
!692 = distinct !DILexicalBlock(scope: !685, file: !3, line: 616, column: 55)
!693 = !DILocation(line: 619, column: 26, scope: !691)
!694 = !DILocation(line: 619, column: 32, scope: !691)
!695 = !DILocation(line: 619, column: 49, scope: !691)
!696 = !DILocation(line: 619, column: 17, scope: !692)
!697 = !DILocation(line: 620, column: 50, scope: !698)
!698 = distinct !DILexicalBlock(scope: !691, file: !3, line: 619, column: 69)
!699 = !DILocation(line: 620, column: 59, scope: !698)
!700 = !DILocation(line: 620, column: 33, scope: !698)
!701 = !DILocation(line: 620, column: 17, scope: !698)
!702 = !DILocation(line: 621, column: 13, scope: !698)
!703 = !DILocation(line: 622, column: 54, scope: !704)
!704 = distinct !DILexicalBlock(scope: !691, file: !3, line: 621, column: 20)
!705 = !DILocation(line: 622, column: 63, scope: !704)
!706 = !DILocation(line: 622, column: 35, scope: !704)
!707 = !DILocation(line: 622, column: 74, scope: !704)
!708 = !DILocation(line: 622, column: 83, scope: !704)
!709 = !DILocation(line: 622, column: 89, scope: !704)
!710 = !DILocation(line: 622, column: 17, scope: !704)
!711 = !DILocation(line: 624, column: 36, scope: !692)
!712 = !DILocation(line: 624, column: 13, scope: !692)
!713 = !DILocation(line: 624, column: 22, scope: !692)
!714 = !DILocation(line: 624, column: 34, scope: !692)
!715 = !DILocation(line: 625, column: 9, scope: !692)
!716 = !DILocation(line: 629, column: 9, scope: !717)
!717 = distinct !DILexicalBlock(scope: !610, file: !3, line: 629, column: 9)
!718 = !DILocation(line: 629, column: 18, scope: !717)
!719 = !DILocation(line: 629, column: 24, scope: !717)
!720 = !DILocation(line: 629, column: 34, scope: !717)
!721 = !DILocation(line: 629, column: 46, scope: !717)
!722 = !DILocation(line: 629, column: 9, scope: !610)
!723 = !DILocation(line: 630, column: 9, scope: !717)
!724 = !DILocation(line: 630, column: 18, scope: !717)
!725 = !DILocation(line: 630, column: 24, scope: !717)
!726 = !DILocation(line: 630, column: 34, scope: !717)
!727 = !DILocation(line: 630, column: 46, scope: !717)
!728 = !DILocation(line: 631, column: 47, scope: !610)
!729 = !DILocation(line: 631, column: 56, scope: !610)
!730 = !DILocation(line: 631, column: 62, scope: !610)
!731 = !DILocation(line: 631, column: 72, scope: !610)
!732 = !DILocation(line: 631, column: 29, scope: !610)
!733 = !DILocation(line: 631, column: 5, scope: !610)
!734 = !DILocation(line: 631, column: 14, scope: !610)
!735 = !DILocation(line: 631, column: 27, scope: !610)
!736 = !DILocation(line: 633, column: 41, scope: !737)
!737 = distinct !DILexicalBlock(scope: !610, file: !3, line: 633, column: 5)
!738 = !DILocation(line: 633, column: 57, scope: !737)
!739 = !DILocation(line: 634, column: 18, scope: !737)
!740 = !DILocation(line: 634, column: 27, scope: !737)
!741 = !DILocation(line: 634, column: 33, scope: !737)
!742 = !DILocation(line: 634, column: 43, scope: !737)
!743 = !DILocation(line: 634, column: 53, scope: !737)
!744 = !DILocation(line: 634, column: 74, scope: !737)
!745 = !DILocation(line: 634, column: 79, scope: !737)
!746 = !DILocation(line: 634, column: 17, scope: !737)
!747 = !DILocation(line: 635, column: 17, scope: !737)
!748 = !DILocation(line: 635, column: 26, scope: !737)
!749 = !DILocation(line: 635, column: 43, scope: !737)
!750 = !DILocation(line: 635, column: 52, scope: !737)
!751 = !DILocation(line: 635, column: 58, scope: !737)
!752 = !DILocation(line: 635, column: 68, scope: !737)
!753 = !DILocation(line: 635, column: 78, scope: !737)
!754 = !DILocation(line: 635, column: 99, scope: !737)
!755 = !DILocation(line: 635, column: 105, scope: !737)
!756 = !DILocation(line: 635, column: 41, scope: !737)
!757 = !DILocation(line: 635, column: 39, scope: !737)
!758 = !DILocation(line: 633, column: 22, scope: !737)
!759 = !DILocation(line: 637, column: 13, scope: !760)
!760 = distinct !DILexicalBlock(scope: !737, file: !3, line: 637, column: 13)
!761 = !DILocation(line: 637, column: 22, scope: !760)
!762 = !DILocation(line: 637, column: 38, scope: !760)
!763 = !DILocation(line: 637, column: 36, scope: !760)
!764 = !DILocation(line: 637, column: 13, scope: !737)
!765 = !DILocation(line: 638, column: 13, scope: !766)
!766 = distinct !DILexicalBlock(scope: !760, file: !3, line: 637, column: 56)
!767 = !DILocation(line: 638, column: 22, scope: !766)
!768 = !DILocation(line: 638, column: 36, scope: !766)
!769 = !DILocation(line: 639, column: 13, scope: !766)
!770 = !DILocation(line: 640, column: 39, scope: !766)
!771 = !DILocation(line: 640, column: 13, scope: !766)
!772 = !DILocation(line: 640, column: 22, scope: !766)
!773 = !DILocation(line: 640, column: 30, scope: !766)
!774 = !DILocation(line: 641, column: 17, scope: !775)
!775 = distinct !DILexicalBlock(scope: !766, file: !3, line: 641, column: 17)
!776 = !DILocation(line: 641, column: 26, scope: !775)
!777 = !DILocation(line: 641, column: 34, scope: !775)
!778 = !DILocation(line: 641, column: 17, scope: !766)
!779 = !DILocation(line: 641, column: 50, scope: !775)
!780 = !DILocation(line: 641, column: 43, scope: !775)
!781 = !DILocation(line: 642, column: 38, scope: !766)
!782 = !DILocation(line: 642, column: 13, scope: !766)
!783 = !DILocation(line: 642, column: 22, scope: !766)
!784 = !DILocation(line: 642, column: 36, scope: !766)
!785 = !DILocation(line: 643, column: 5, scope: !766)
!786 = !DILocation(line: 644, column: 22, scope: !610)
!787 = !DILocation(line: 644, column: 31, scope: !610)
!788 = !DILocation(line: 644, column: 5, scope: !610)
!789 = !DILocation(line: 644, column: 14, scope: !610)
!790 = !DILocation(line: 644, column: 20, scope: !610)
!791 = !DILocation(line: 645, column: 5, scope: !610)
!792 = !DILocation(line: 645, column: 14, scope: !610)
!793 = !DILocation(line: 645, column: 24, scope: !610)
!794 = !DILocation(line: 646, column: 25, scope: !610)
!795 = !DILocation(line: 646, column: 34, scope: !610)
!796 = !DILocation(line: 646, column: 11, scope: !610)
!797 = !DILocation(line: 649, column: 22, scope: !610)
!798 = !DILocation(line: 649, column: 5, scope: !610)
!799 = !DILocation(line: 649, column: 14, scope: !610)
!800 = !DILocation(line: 649, column: 20, scope: !610)
!801 = !DILocation(line: 650, column: 9, scope: !802)
!802 = distinct !DILexicalBlock(scope: !610, file: !3, line: 650, column: 9)
!803 = !DILocation(line: 650, column: 18, scope: !802)
!804 = !DILocation(line: 650, column: 24, scope: !802)
!805 = !DILocation(line: 650, column: 34, scope: !802)
!806 = !DILocation(line: 650, column: 44, scope: !802)
!807 = !DILocation(line: 650, column: 9, scope: !610)
!808 = !DILocation(line: 652, column: 25, scope: !809)
!809 = distinct !DILexicalBlock(scope: !802, file: !3, line: 650, column: 65)
!810 = !DILocation(line: 652, column: 34, scope: !809)
!811 = !DILocation(line: 652, column: 45, scope: !809)
!812 = !DILocation(line: 652, column: 52, scope: !809)
!813 = !DILocation(line: 652, column: 61, scope: !809)
!814 = !DILocation(line: 652, column: 67, scope: !809)
!815 = !DILocation(line: 652, column: 9, scope: !809)
!816 = !DILocation(line: 653, column: 5, scope: !809)
!817 = !DILocation(line: 654, column: 9, scope: !818)
!818 = distinct !DILexicalBlock(scope: !610, file: !3, line: 654, column: 9)
!819 = !DILocation(line: 654, column: 25, scope: !818)
!820 = !DILocation(line: 654, column: 42, scope: !818)
!821 = !DILocation(line: 654, column: 9, scope: !610)
!822 = !DILocation(line: 655, column: 54, scope: !823)
!823 = distinct !DILexicalBlock(scope: !818, file: !3, line: 654, column: 63)
!824 = !DILocation(line: 655, column: 63, scope: !823)
!825 = !DILocation(line: 655, column: 37, scope: !823)
!826 = !DILocation(line: 655, column: 79, scope: !823)
!827 = !DILocation(line: 655, column: 95, scope: !823)
!828 = !DILocation(line: 655, column: 9, scope: !823)
!829 = !DILocation(line: 656, column: 5, scope: !823)
!830 = !DILocation(line: 659, column: 20, scope: !610)
!831 = !DILocation(line: 659, column: 5, scope: !610)
!832 = !DILocation(line: 660, column: 12, scope: !610)
!833 = !DILocation(line: 661, column: 19, scope: !610)
!834 = !DILocation(line: 661, column: 17, scope: !610)
!835 = !DILocation(line: 665, column: 13, scope: !610)
!836 = !DILocation(line: 665, column: 22, scope: !610)
!837 = !DILocation(line: 665, column: 28, scope: !610)
!838 = !DILocation(line: 665, column: 38, scope: !610)
!839 = !DILocation(line: 665, column: 48, scope: !610)
!840 = !DILocation(line: 665, column: 58, scope: !610)
!841 = !DILocation(line: 665, column: 9, scope: !610)
!842 = !DILocation(line: 666, column: 13, scope: !610)
!843 = !DILocation(line: 666, column: 22, scope: !610)
!844 = !DILocation(line: 666, column: 28, scope: !610)
!845 = !DILocation(line: 666, column: 38, scope: !610)
!846 = !DILocation(line: 666, column: 56, scope: !610)
!847 = !DILocation(line: 666, column: 66, scope: !610)
!848 = !DILocation(line: 666, column: 9, scope: !610)
!849 = !DILocation(line: 667, column: 23, scope: !610)
!850 = !DILocation(line: 667, column: 32, scope: !610)
!851 = !DILocation(line: 667, column: 38, scope: !610)
!852 = !DILocation(line: 667, column: 48, scope: !610)
!853 = !DILocation(line: 667, column: 60, scope: !610)
!854 = !DILocation(line: 667, column: 65, scope: !610)
!855 = !DILocation(line: 667, column: 9, scope: !610)
!856 = !DILocation(line: 668, column: 13, scope: !610)
!857 = !DILocation(line: 668, column: 22, scope: !610)
!858 = !DILocation(line: 668, column: 28, scope: !610)
!859 = !DILocation(line: 668, column: 38, scope: !610)
!860 = !DILocation(line: 668, column: 58, scope: !610)
!861 = !DILocation(line: 668, column: 68, scope: !610)
!862 = !DILocation(line: 668, column: 9, scope: !610)
!863 = !DILocation(line: 669, column: 13, scope: !610)
!864 = !DILocation(line: 669, column: 22, scope: !610)
!865 = !DILocation(line: 669, column: 28, scope: !610)
!866 = !DILocation(line: 669, column: 38, scope: !610)
!867 = !DILocation(line: 669, column: 45, scope: !610)
!868 = !DILocation(line: 669, column: 9, scope: !610)
!869 = !DILocation(line: 664, column: 17, scope: !610)
!870 = !DILocation(line: 664, column: 12, scope: !610)
!871 = !DILocation(line: 664, column: 15, scope: !610)
!872 = !DILocation(line: 671, column: 25, scope: !610)
!873 = !DILocation(line: 671, column: 34, scope: !610)
!874 = !DILocation(line: 671, column: 40, scope: !610)
!875 = !DILocation(line: 671, column: 50, scope: !610)
!876 = !DILocation(line: 671, column: 62, scope: !610)
!877 = !DILocation(line: 671, column: 72, scope: !610)
!878 = !DILocation(line: 671, column: 17, scope: !610)
!879 = !DILocation(line: 671, column: 12, scope: !610)
!880 = !DILocation(line: 671, column: 15, scope: !610)
!881 = !DILocation(line: 673, column: 9, scope: !882)
!882 = distinct !DILexicalBlock(scope: !610, file: !3, line: 673, column: 9)
!883 = !DILocation(line: 673, column: 18, scope: !882)
!884 = !DILocation(line: 673, column: 24, scope: !882)
!885 = !DILocation(line: 673, column: 34, scope: !882)
!886 = !DILocation(line: 673, column: 9, scope: !610)
!887 = !DILocation(line: 674, column: 24, scope: !888)
!888 = distinct !DILexicalBlock(scope: !882, file: !3, line: 673, column: 47)
!889 = !DILocation(line: 674, column: 32, scope: !888)
!890 = !DILocation(line: 674, column: 41, scope: !888)
!891 = !DILocation(line: 674, column: 47, scope: !888)
!892 = !DILocation(line: 674, column: 57, scope: !888)
!893 = !DILocation(line: 674, column: 9, scope: !888)
!894 = !DILocation(line: 675, column: 16, scope: !888)
!895 = !DILocation(line: 676, column: 9, scope: !888)
!896 = !DILocation(line: 676, column: 18, scope: !888)
!897 = !DILocation(line: 676, column: 30, scope: !888)
!898 = !DILocation(line: 677, column: 5, scope: !888)
!899 = !DILocation(line: 679, column: 9, scope: !900)
!900 = distinct !DILexicalBlock(scope: !610, file: !3, line: 679, column: 9)
!901 = !DILocation(line: 679, column: 18, scope: !900)
!902 = !DILocation(line: 679, column: 24, scope: !900)
!903 = !DILocation(line: 679, column: 34, scope: !900)
!904 = !DILocation(line: 679, column: 9, scope: !610)
!905 = !DILocation(line: 680, column: 24, scope: !906)
!906 = distinct !DILexicalBlock(scope: !900, file: !3, line: 679, column: 42)
!907 = !DILocation(line: 680, column: 32, scope: !906)
!908 = !DILocation(line: 680, column: 41, scope: !906)
!909 = !DILocation(line: 680, column: 47, scope: !906)
!910 = !DILocation(line: 680, column: 57, scope: !906)
!911 = !DILocation(line: 680, column: 9, scope: !906)
!912 = !DILocation(line: 681, column: 16, scope: !906)
!913 = !DILocation(line: 682, column: 5, scope: !906)
!914 = !DILocation(line: 684, column: 35, scope: !610)
!915 = !DILocation(line: 684, column: 57, scope: !610)
!916 = !DILocation(line: 684, column: 66, scope: !610)
!917 = !DILocation(line: 684, column: 64, scope: !610)
!918 = !DILocation(line: 684, column: 15, scope: !610)
!919 = !DILocation(line: 684, column: 6, scope: !610)
!920 = !DILocation(line: 684, column: 13, scope: !610)
!921 = !DILocation(line: 685, column: 11, scope: !610)
!922 = !DILocation(line: 687, column: 5, scope: !610)
!923 = !DILocation(line: 687, column: 14, scope: !610)
!924 = !DILocation(line: 687, column: 21, scope: !610)
!925 = !DILocation(line: 688, column: 21, scope: !610)
!926 = !DILocation(line: 688, column: 30, scope: !610)
!927 = !DILocation(line: 688, column: 28, scope: !610)
!928 = !DILocation(line: 688, column: 5, scope: !610)
!929 = !DILocation(line: 689, column: 1, scope: !610)
!930 = distinct !DISubprogram(name: "LZ4F_compressUpdate", scope: !3, file: !3, line: 810, type: !931, isLocal: false, isDefinition: true, scopeLine: 814, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!931 = !DISubroutineType(types: !932)
!932 = !{!11, !239, !90, !11, !470, !11, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZ4F_compressOptions_t", file: !10, line: 229, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 226, size: 128, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "stableSrc", scope: !936, file: !10, line: 227, baseType: !121, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !936, file: !10, line: 228, baseType: !202, size: 96, offset: 32)
!940 = !DILocation(line: 816, column: 30, scope: !930)
!941 = !DILocation(line: 816, column: 39, scope: !930)
!942 = !DILocation(line: 816, column: 18, scope: !930)
!943 = !DILocation(line: 817, column: 39, scope: !930)
!944 = !DILocation(line: 817, column: 17, scope: !930)
!945 = !DILocation(line: 818, column: 32, scope: !930)
!946 = !DILocation(line: 818, column: 41, scope: !930)
!947 = !DILocation(line: 818, column: 39, scope: !930)
!948 = !DILocation(line: 818, column: 23, scope: !930)
!949 = !DILocation(line: 819, column: 35, scope: !930)
!950 = !DILocation(line: 819, column: 17, scope: !930)
!951 = !DILocation(line: 820, column: 20, scope: !930)
!952 = !DILocation(line: 820, column: 11, scope: !930)
!953 = !DILocation(line: 821, column: 26, scope: !930)
!954 = !DILocation(line: 822, column: 60, scope: !930)
!955 = !DILocation(line: 822, column: 69, scope: !930)
!956 = !DILocation(line: 822, column: 75, scope: !930)
!957 = !DILocation(line: 822, column: 85, scope: !930)
!958 = !DILocation(line: 822, column: 96, scope: !930)
!959 = !DILocation(line: 822, column: 105, scope: !930)
!960 = !DILocation(line: 822, column: 111, scope: !930)
!961 = !DILocation(line: 822, column: 37, scope: !930)
!962 = !DILocation(line: 822, column: 26, scope: !930)
!963 = !DILocation(line: 826, column: 9, scope: !964)
!964 = distinct !DILexicalBlock(scope: !930, file: !3, line: 826, column: 9)
!965 = !DILocation(line: 826, column: 18, scope: !964)
!966 = !DILocation(line: 826, column: 25, scope: !964)
!967 = !DILocation(line: 826, column: 9, scope: !930)
!968 = !DILocation(line: 826, column: 38, scope: !964)
!969 = !DILocation(line: 826, column: 31, scope: !964)
!970 = !DILocation(line: 827, column: 9, scope: !971)
!971 = distinct !DILexicalBlock(scope: !930, file: !3, line: 827, column: 9)
!972 = !DILocation(line: 827, column: 51, scope: !971)
!973 = !DILocation(line: 827, column: 62, scope: !971)
!974 = !DILocation(line: 827, column: 71, scope: !971)
!975 = !DILocation(line: 827, column: 79, scope: !971)
!976 = !DILocation(line: 827, column: 88, scope: !971)
!977 = !DILocation(line: 827, column: 23, scope: !971)
!978 = !DILocation(line: 827, column: 21, scope: !971)
!979 = !DILocation(line: 827, column: 9, scope: !930)
!980 = !DILocation(line: 828, column: 16, scope: !971)
!981 = !DILocation(line: 828, column: 9, scope: !971)
!982 = !DILocation(line: 829, column: 5, scope: !930)
!983 = !DILocation(line: 830, column: 9, scope: !984)
!984 = distinct !DILexicalBlock(scope: !930, file: !3, line: 830, column: 9)
!985 = !DILocation(line: 830, column: 28, scope: !984)
!986 = !DILocation(line: 830, column: 9, scope: !930)
!987 = !DILocation(line: 830, column: 56, scope: !984)
!988 = !DILocation(line: 830, column: 37, scope: !984)
!989 = !DILocation(line: 833, column: 9, scope: !990)
!990 = distinct !DILexicalBlock(scope: !930, file: !3, line: 833, column: 9)
!991 = !DILocation(line: 833, column: 18, scope: !990)
!992 = !DILocation(line: 833, column: 28, scope: !990)
!993 = !DILocation(line: 833, column: 9, scope: !930)
!994 = !DILocation(line: 834, column: 35, scope: !995)
!995 = distinct !DILexicalBlock(scope: !990, file: !3, line: 833, column: 33)
!996 = !DILocation(line: 834, column: 47, scope: !995)
!997 = !DILocation(line: 834, column: 56, scope: !995)
!998 = !DILocation(line: 834, column: 45, scope: !995)
!999 = !DILocation(line: 834, column: 22, scope: !995)
!1000 = !DILocation(line: 835, column: 13, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !995, file: !3, line: 835, column: 13)
!1002 = !DILocation(line: 835, column: 26, scope: !1001)
!1003 = !DILocation(line: 835, column: 24, scope: !1001)
!1004 = !DILocation(line: 835, column: 13, scope: !995)
!1005 = !DILocation(line: 837, column: 20, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 835, column: 35)
!1007 = !DILocation(line: 837, column: 29, scope: !1006)
!1008 = !DILocation(line: 837, column: 37, scope: !1006)
!1009 = !DILocation(line: 837, column: 46, scope: !1006)
!1010 = !DILocation(line: 837, column: 35, scope: !1006)
!1011 = !DILocation(line: 837, column: 57, scope: !1006)
!1012 = !DILocation(line: 837, column: 68, scope: !1006)
!1013 = !DILocation(line: 837, column: 13, scope: !1006)
!1014 = !DILocation(line: 838, column: 22, scope: !1006)
!1015 = !DILocation(line: 838, column: 20, scope: !1006)
!1016 = !DILocation(line: 839, column: 35, scope: !1006)
!1017 = !DILocation(line: 839, column: 13, scope: !1006)
!1018 = !DILocation(line: 839, column: 22, scope: !1006)
!1019 = !DILocation(line: 839, column: 32, scope: !1006)
!1020 = !DILocation(line: 841, column: 9, scope: !1006)
!1021 = !DILocation(line: 843, column: 33, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 841, column: 16)
!1023 = !DILocation(line: 844, column: 20, scope: !1022)
!1024 = !DILocation(line: 844, column: 29, scope: !1022)
!1025 = !DILocation(line: 844, column: 37, scope: !1022)
!1026 = !DILocation(line: 844, column: 46, scope: !1022)
!1027 = !DILocation(line: 844, column: 35, scope: !1022)
!1028 = !DILocation(line: 844, column: 57, scope: !1022)
!1029 = !DILocation(line: 844, column: 68, scope: !1022)
!1030 = !DILocation(line: 844, column: 13, scope: !1022)
!1031 = !DILocation(line: 845, column: 23, scope: !1022)
!1032 = !DILocation(line: 845, column: 20, scope: !1022)
!1033 = !DILocation(line: 847, column: 38, scope: !1022)
!1034 = !DILocation(line: 848, column: 38, scope: !1022)
!1035 = !DILocation(line: 848, column: 47, scope: !1022)
!1036 = !DILocation(line: 848, column: 54, scope: !1022)
!1037 = !DILocation(line: 849, column: 38, scope: !1022)
!1038 = !DILocation(line: 849, column: 48, scope: !1022)
!1039 = !DILocation(line: 849, column: 57, scope: !1022)
!1040 = !DILocation(line: 849, column: 68, scope: !1022)
!1041 = !DILocation(line: 849, column: 77, scope: !1022)
!1042 = !DILocation(line: 849, column: 83, scope: !1022)
!1043 = !DILocation(line: 850, column: 38, scope: !1022)
!1044 = !DILocation(line: 850, column: 47, scope: !1022)
!1045 = !DILocation(line: 851, column: 38, scope: !1022)
!1046 = !DILocation(line: 851, column: 47, scope: !1022)
!1047 = !DILocation(line: 851, column: 53, scope: !1022)
!1048 = !DILocation(line: 851, column: 63, scope: !1022)
!1049 = !DILocation(line: 847, column: 23, scope: !1022)
!1050 = !DILocation(line: 847, column: 20, scope: !1022)
!1051 = !DILocation(line: 853, column: 17, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 853, column: 17)
!1053 = !DILocation(line: 853, column: 26, scope: !1052)
!1054 = !DILocation(line: 853, column: 32, scope: !1052)
!1055 = !DILocation(line: 853, column: 42, scope: !1052)
!1056 = !DILocation(line: 853, column: 51, scope: !1052)
!1057 = !DILocation(line: 853, column: 17, scope: !1022)
!1058 = !DILocation(line: 853, column: 89, scope: !1052)
!1059 = !DILocation(line: 853, column: 71, scope: !1052)
!1060 = !DILocation(line: 853, column: 80, scope: !1052)
!1061 = !DILocation(line: 853, column: 86, scope: !1052)
!1062 = !DILocation(line: 854, column: 13, scope: !1022)
!1063 = !DILocation(line: 854, column: 22, scope: !1022)
!1064 = !DILocation(line: 854, column: 32, scope: !1022)
!1065 = !DILocation(line: 856, column: 5, scope: !995)
!1066 = !DILocation(line: 858, column: 5, scope: !930)
!1067 = !DILocation(line: 858, column: 21, scope: !930)
!1068 = !DILocation(line: 858, column: 30, scope: !930)
!1069 = !DILocation(line: 858, column: 28, scope: !930)
!1070 = !DILocation(line: 858, column: 41, scope: !930)
!1071 = !DILocation(line: 858, column: 38, scope: !930)
!1072 = !DILocation(line: 860, column: 29, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !930, file: !3, line: 858, column: 52)
!1074 = !DILocation(line: 861, column: 34, scope: !1073)
!1075 = !DILocation(line: 862, column: 34, scope: !1073)
!1076 = !DILocation(line: 862, column: 42, scope: !1073)
!1077 = !DILocation(line: 863, column: 34, scope: !1073)
!1078 = !DILocation(line: 863, column: 44, scope: !1073)
!1079 = !DILocation(line: 863, column: 53, scope: !1073)
!1080 = !DILocation(line: 863, column: 64, scope: !1073)
!1081 = !DILocation(line: 863, column: 73, scope: !1073)
!1082 = !DILocation(line: 863, column: 79, scope: !1073)
!1083 = !DILocation(line: 864, column: 34, scope: !1073)
!1084 = !DILocation(line: 864, column: 43, scope: !1073)
!1085 = !DILocation(line: 865, column: 34, scope: !1073)
!1086 = !DILocation(line: 865, column: 43, scope: !1073)
!1087 = !DILocation(line: 865, column: 49, scope: !1073)
!1088 = !DILocation(line: 865, column: 59, scope: !1073)
!1089 = !DILocation(line: 861, column: 19, scope: !1073)
!1090 = !DILocation(line: 861, column: 16, scope: !1073)
!1091 = !DILocation(line: 866, column: 19, scope: !1073)
!1092 = !DILocation(line: 866, column: 16, scope: !1073)
!1093 = distinct !{!1093, !1066, !1094}
!1094 = !DILocation(line: 867, column: 5, scope: !930)
!1095 = !DILocation(line: 869, column: 10, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !930, file: !3, line: 869, column: 9)
!1097 = !DILocation(line: 869, column: 19, scope: !1096)
!1098 = !DILocation(line: 869, column: 25, scope: !1096)
!1099 = !DILocation(line: 869, column: 9, scope: !1096)
!1100 = !DILocation(line: 869, column: 36, scope: !1096)
!1101 = !DILocation(line: 869, column: 40, scope: !1096)
!1102 = !DILocation(line: 869, column: 49, scope: !1096)
!1103 = !DILocation(line: 869, column: 47, scope: !1096)
!1104 = !DILocation(line: 869, column: 9, scope: !930)
!1105 = !DILocation(line: 871, column: 29, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 869, column: 58)
!1107 = !DILocation(line: 872, column: 34, scope: !1106)
!1108 = !DILocation(line: 873, column: 34, scope: !1106)
!1109 = !DILocation(line: 873, column: 51, scope: !1106)
!1110 = !DILocation(line: 873, column: 60, scope: !1106)
!1111 = !DILocation(line: 873, column: 58, scope: !1106)
!1112 = !DILocation(line: 874, column: 34, scope: !1106)
!1113 = !DILocation(line: 874, column: 44, scope: !1106)
!1114 = !DILocation(line: 874, column: 53, scope: !1106)
!1115 = !DILocation(line: 874, column: 64, scope: !1106)
!1116 = !DILocation(line: 874, column: 73, scope: !1106)
!1117 = !DILocation(line: 874, column: 79, scope: !1106)
!1118 = !DILocation(line: 875, column: 34, scope: !1106)
!1119 = !DILocation(line: 875, column: 43, scope: !1106)
!1120 = !DILocation(line: 876, column: 34, scope: !1106)
!1121 = !DILocation(line: 876, column: 43, scope: !1106)
!1122 = !DILocation(line: 876, column: 49, scope: !1106)
!1123 = !DILocation(line: 876, column: 59, scope: !1106)
!1124 = !DILocation(line: 872, column: 19, scope: !1106)
!1125 = !DILocation(line: 872, column: 16, scope: !1106)
!1126 = !DILocation(line: 877, column: 19, scope: !1106)
!1127 = !DILocation(line: 877, column: 17, scope: !1106)
!1128 = !DILocation(line: 878, column: 5, scope: !1106)
!1129 = !DILocation(line: 881, column: 10, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !930, file: !3, line: 881, column: 9)
!1131 = !DILocation(line: 881, column: 19, scope: !1130)
!1132 = !DILocation(line: 881, column: 25, scope: !1130)
!1133 = !DILocation(line: 881, column: 35, scope: !1130)
!1134 = !DILocation(line: 881, column: 44, scope: !1130)
!1135 = !DILocation(line: 881, column: 64, scope: !1130)
!1136 = !DILocation(line: 881, column: 68, scope: !1130)
!1137 = !DILocation(line: 881, column: 87, scope: !1130)
!1138 = !DILocation(line: 881, column: 9, scope: !930)
!1139 = !DILocation(line: 882, column: 13, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 882, column: 13)
!1141 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 881, column: 105)
!1142 = !DILocation(line: 882, column: 33, scope: !1140)
!1143 = !DILocation(line: 882, column: 13, scope: !1141)
!1144 = !DILocation(line: 883, column: 30, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 882, column: 44)
!1146 = !DILocation(line: 883, column: 39, scope: !1145)
!1147 = !DILocation(line: 883, column: 13, scope: !1145)
!1148 = !DILocation(line: 883, column: 22, scope: !1145)
!1149 = !DILocation(line: 883, column: 28, scope: !1145)
!1150 = !DILocation(line: 884, column: 9, scope: !1145)
!1151 = !DILocation(line: 885, column: 57, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 884, column: 16)
!1153 = !DILocation(line: 885, column: 38, scope: !1152)
!1154 = !DILocation(line: 885, column: 23, scope: !1152)
!1155 = !DILocation(line: 886, column: 17, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 886, column: 17)
!1157 = !DILocation(line: 886, column: 29, scope: !1156)
!1158 = !DILocation(line: 886, column: 17, scope: !1152)
!1159 = !DILocation(line: 886, column: 41, scope: !1156)
!1160 = !DILocation(line: 886, column: 34, scope: !1156)
!1161 = !DILocation(line: 887, column: 30, scope: !1152)
!1162 = !DILocation(line: 887, column: 39, scope: !1152)
!1163 = !DILocation(line: 887, column: 49, scope: !1152)
!1164 = !DILocation(line: 887, column: 47, scope: !1152)
!1165 = !DILocation(line: 887, column: 13, scope: !1152)
!1166 = !DILocation(line: 887, column: 22, scope: !1152)
!1167 = !DILocation(line: 887, column: 28, scope: !1152)
!1168 = !DILocation(line: 889, column: 5, scope: !1141)
!1169 = !DILocation(line: 892, column: 10, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !930, file: !3, line: 892, column: 9)
!1171 = !DILocation(line: 892, column: 19, scope: !1170)
!1172 = !DILocation(line: 892, column: 27, scope: !1170)
!1173 = !DILocation(line: 892, column: 25, scope: !1170)
!1174 = !DILocation(line: 892, column: 41, scope: !1170)
!1175 = !DILocation(line: 892, column: 50, scope: !1170)
!1176 = !DILocation(line: 892, column: 60, scope: !1170)
!1177 = !DILocation(line: 892, column: 69, scope: !1170)
!1178 = !DILocation(line: 892, column: 58, scope: !1170)
!1179 = !DILocation(line: 892, column: 38, scope: !1170)
!1180 = !DILocation(line: 893, column: 9, scope: !1170)
!1181 = !DILocation(line: 893, column: 14, scope: !1170)
!1182 = !DILocation(line: 893, column: 23, scope: !1170)
!1183 = !DILocation(line: 893, column: 29, scope: !1170)
!1184 = !DILocation(line: 893, column: 13, scope: !1170)
!1185 = !DILocation(line: 892, column: 9, scope: !930)
!1186 = !DILocation(line: 895, column: 53, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 894, column: 5)
!1188 = !DILocation(line: 895, column: 34, scope: !1187)
!1189 = !DILocation(line: 895, column: 19, scope: !1187)
!1190 = !DILocation(line: 896, column: 26, scope: !1187)
!1191 = !DILocation(line: 896, column: 35, scope: !1187)
!1192 = !DILocation(line: 896, column: 45, scope: !1187)
!1193 = !DILocation(line: 896, column: 43, scope: !1187)
!1194 = !DILocation(line: 896, column: 9, scope: !1187)
!1195 = !DILocation(line: 896, column: 18, scope: !1187)
!1196 = !DILocation(line: 896, column: 24, scope: !1187)
!1197 = !DILocation(line: 897, column: 5, scope: !1187)
!1198 = !DILocation(line: 900, column: 9, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !930, file: !3, line: 900, column: 9)
!1200 = !DILocation(line: 900, column: 18, scope: !1199)
!1201 = !DILocation(line: 900, column: 16, scope: !1199)
!1202 = !DILocation(line: 900, column: 9, scope: !930)
!1203 = !DILocation(line: 902, column: 44, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 900, column: 26)
!1205 = !DILocation(line: 902, column: 53, scope: !1204)
!1206 = !DILocation(line: 902, column: 51, scope: !1204)
!1207 = !DILocation(line: 902, column: 22, scope: !1204)
!1208 = !DILocation(line: 903, column: 16, scope: !1204)
!1209 = !DILocation(line: 903, column: 25, scope: !1204)
!1210 = !DILocation(line: 903, column: 32, scope: !1204)
!1211 = !DILocation(line: 903, column: 40, scope: !1204)
!1212 = !DILocation(line: 903, column: 9, scope: !1204)
!1213 = !DILocation(line: 904, column: 30, scope: !1204)
!1214 = !DILocation(line: 904, column: 9, scope: !1204)
!1215 = !DILocation(line: 904, column: 18, scope: !1204)
!1216 = !DILocation(line: 904, column: 28, scope: !1204)
!1217 = !DILocation(line: 905, column: 5, scope: !1204)
!1218 = !DILocation(line: 907, column: 9, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !930, file: !3, line: 907, column: 9)
!1220 = !DILocation(line: 907, column: 18, scope: !1219)
!1221 = !DILocation(line: 907, column: 24, scope: !1219)
!1222 = !DILocation(line: 907, column: 34, scope: !1219)
!1223 = !DILocation(line: 907, column: 54, scope: !1219)
!1224 = !DILocation(line: 907, column: 9, scope: !930)
!1225 = !DILocation(line: 908, column: 30, scope: !1219)
!1226 = !DILocation(line: 908, column: 39, scope: !1219)
!1227 = !DILocation(line: 908, column: 45, scope: !1219)
!1228 = !DILocation(line: 908, column: 56, scope: !1219)
!1229 = !DILocation(line: 908, column: 15, scope: !1219)
!1230 = !DILocation(line: 908, column: 9, scope: !1219)
!1231 = !DILocation(line: 910, column: 29, scope: !930)
!1232 = !DILocation(line: 910, column: 5, scope: !930)
!1233 = !DILocation(line: 910, column: 14, scope: !930)
!1234 = !DILocation(line: 910, column: 26, scope: !930)
!1235 = !DILocation(line: 911, column: 21, scope: !930)
!1236 = !DILocation(line: 911, column: 30, scope: !930)
!1237 = !DILocation(line: 911, column: 28, scope: !930)
!1238 = !DILocation(line: 911, column: 5, scope: !930)
!1239 = !DILocation(line: 912, column: 1, scope: !930)
!1240 = distinct !DISubprogram(name: "LZ4F_compressEnd", scope: !3, file: !3, line: 971, type: !1241, isLocal: false, isDefinition: true, scopeLine: 974, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!11, !239, !90, !11, !933}
!1243 = !DILocation(line: 975, column: 35, scope: !1240)
!1244 = !DILocation(line: 975, column: 17, scope: !1240)
!1245 = !DILocation(line: 976, column: 20, scope: !1240)
!1246 = !DILocation(line: 976, column: 11, scope: !1240)
!1247 = !DILocation(line: 978, column: 41, scope: !1240)
!1248 = !DILocation(line: 978, column: 50, scope: !1240)
!1249 = !DILocation(line: 978, column: 61, scope: !1240)
!1250 = !DILocation(line: 978, column: 74, scope: !1240)
!1251 = !DILocation(line: 978, column: 30, scope: !1240)
!1252 = !DILocation(line: 978, column: 18, scope: !1240)
!1253 = !DILocation(line: 979, column: 22, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 979, column: 9)
!1255 = !DILocation(line: 979, column: 9, scope: !1254)
!1256 = !DILocation(line: 979, column: 9, scope: !1240)
!1257 = !DILocation(line: 979, column: 41, scope: !1254)
!1258 = !DILocation(line: 979, column: 34, scope: !1254)
!1259 = !DILocation(line: 980, column: 15, scope: !1240)
!1260 = !DILocation(line: 980, column: 12, scope: !1240)
!1261 = !DILocation(line: 983, column: 20, scope: !1240)
!1262 = !DILocation(line: 983, column: 17, scope: !1240)
!1263 = !DILocation(line: 985, column: 9, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 985, column: 9)
!1265 = !DILocation(line: 985, column: 21, scope: !1264)
!1266 = !DILocation(line: 985, column: 9, scope: !1240)
!1267 = !DILocation(line: 985, column: 33, scope: !1264)
!1268 = !DILocation(line: 985, column: 26, scope: !1264)
!1269 = !DILocation(line: 986, column: 20, scope: !1240)
!1270 = !DILocation(line: 986, column: 5, scope: !1240)
!1271 = !DILocation(line: 987, column: 12, scope: !1240)
!1272 = !DILocation(line: 989, column: 9, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 989, column: 9)
!1274 = !DILocation(line: 989, column: 18, scope: !1273)
!1275 = !DILocation(line: 989, column: 24, scope: !1273)
!1276 = !DILocation(line: 989, column: 34, scope: !1273)
!1277 = !DILocation(line: 989, column: 54, scope: !1273)
!1278 = !DILocation(line: 989, column: 9, scope: !1240)
!1279 = !DILocation(line: 990, column: 40, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1273, file: !3, line: 989, column: 86)
!1281 = !DILocation(line: 990, column: 49, scope: !1280)
!1282 = !DILocation(line: 990, column: 25, scope: !1280)
!1283 = !DILocation(line: 990, column: 19, scope: !1280)
!1284 = !DILocation(line: 991, column: 13, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1280, file: !3, line: 991, column: 13)
!1286 = !DILocation(line: 991, column: 25, scope: !1285)
!1287 = !DILocation(line: 991, column: 13, scope: !1280)
!1288 = !DILocation(line: 991, column: 37, scope: !1285)
!1289 = !DILocation(line: 991, column: 30, scope: !1285)
!1290 = !DILocation(line: 992, column: 24, scope: !1280)
!1291 = !DILocation(line: 992, column: 32, scope: !1280)
!1292 = !DILocation(line: 992, column: 9, scope: !1280)
!1293 = !DILocation(line: 993, column: 15, scope: !1280)
!1294 = !DILocation(line: 994, column: 5, scope: !1280)
!1295 = !DILocation(line: 996, column: 5, scope: !1240)
!1296 = !DILocation(line: 996, column: 14, scope: !1240)
!1297 = !DILocation(line: 996, column: 21, scope: !1240)
!1298 = !DILocation(line: 997, column: 5, scope: !1240)
!1299 = !DILocation(line: 997, column: 14, scope: !1240)
!1300 = !DILocation(line: 997, column: 28, scope: !1240)
!1301 = !DILocation(line: 999, column: 9, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 999, column: 9)
!1303 = !DILocation(line: 999, column: 18, scope: !1302)
!1304 = !DILocation(line: 999, column: 24, scope: !1302)
!1305 = !DILocation(line: 999, column: 34, scope: !1302)
!1306 = !DILocation(line: 999, column: 9, scope: !1240)
!1307 = !DILocation(line: 1000, column: 13, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1309, file: !3, line: 1000, column: 13)
!1309 = distinct !DILexicalBlock(scope: !1302, file: !3, line: 999, column: 47)
!1310 = !DILocation(line: 1000, column: 22, scope: !1308)
!1311 = !DILocation(line: 1000, column: 28, scope: !1308)
!1312 = !DILocation(line: 1000, column: 38, scope: !1308)
!1313 = !DILocation(line: 1000, column: 53, scope: !1308)
!1314 = !DILocation(line: 1000, column: 62, scope: !1308)
!1315 = !DILocation(line: 1000, column: 50, scope: !1308)
!1316 = !DILocation(line: 1000, column: 13, scope: !1309)
!1317 = !DILocation(line: 1001, column: 20, scope: !1308)
!1318 = !DILocation(line: 1001, column: 13, scope: !1308)
!1319 = !DILocation(line: 1002, column: 5, scope: !1309)
!1320 = !DILocation(line: 1004, column: 21, scope: !1240)
!1321 = !DILocation(line: 1004, column: 30, scope: !1240)
!1322 = !DILocation(line: 1004, column: 28, scope: !1240)
!1323 = !DILocation(line: 1004, column: 5, scope: !1240)
!1324 = !DILocation(line: 1005, column: 1, scope: !1240)
!1325 = distinct !DISubprogram(name: "LZ4F_compressFrame", scope: !3, file: !3, line: 418, type: !1326, isLocal: false, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!11, !90, !11, !470, !11, !372}
!1328 = !DILocation(line: 430, column: 18, scope: !1325)
!1329 = !DILocation(line: 433, column: 5, scope: !1325)
!1330 = !DILocation(line: 434, column: 10, scope: !1325)
!1331 = !DILocation(line: 434, column: 18, scope: !1325)
!1332 = !DILocation(line: 435, column: 10, scope: !1325)
!1333 = !DILocation(line: 435, column: 24, scope: !1325)
!1334 = !DILocation(line: 436, column: 9, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1325, file: !3, line: 436, column: 9)
!1336 = !DILocation(line: 436, column: 24, scope: !1335)
!1337 = !DILocation(line: 436, column: 32, scope: !1335)
!1338 = !DILocation(line: 437, column: 9, scope: !1335)
!1339 = !DILocation(line: 437, column: 25, scope: !1335)
!1340 = !DILocation(line: 437, column: 42, scope: !1335)
!1341 = !DILocation(line: 436, column: 9, scope: !1325)
!1342 = !DILocation(line: 439, column: 9, scope: !1343)
!1343 = distinct !DILexicalBlock(scope: !1335, file: !3, line: 438, column: 5)
!1344 = !DILocation(line: 440, column: 30, scope: !1343)
!1345 = !DILocation(line: 440, column: 9, scope: !1343)
!1346 = !DILocation(line: 440, column: 18, scope: !1343)
!1347 = !DILocation(line: 440, column: 28, scope: !1343)
!1348 = !DILocation(line: 441, column: 9, scope: !1343)
!1349 = !DILocation(line: 441, column: 18, scope: !1343)
!1350 = !DILocation(line: 441, column: 30, scope: !1343)
!1351 = !DILocation(line: 442, column: 9, scope: !1343)
!1352 = !DILocation(line: 442, column: 18, scope: !1343)
!1353 = !DILocation(line: 442, column: 30, scope: !1343)
!1354 = !DILocation(line: 443, column: 5, scope: !1343)
!1355 = !DILocation(line: 446, column: 44, scope: !1325)
!1356 = !DILocation(line: 446, column: 53, scope: !1325)
!1357 = !DILocation(line: 446, column: 64, scope: !1325)
!1358 = !DILocation(line: 447, column: 44, scope: !1325)
!1359 = !DILocation(line: 447, column: 55, scope: !1325)
!1360 = !DILocation(line: 448, column: 50, scope: !1325)
!1361 = !DILocation(line: 446, column: 14, scope: !1325)
!1362 = !DILocation(line: 446, column: 12, scope: !1325)
!1363 = !DILocation(line: 453, column: 9, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1325, file: !3, line: 453, column: 9)
!1365 = !DILocation(line: 453, column: 24, scope: !1364)
!1366 = !DILocation(line: 453, column: 32, scope: !1364)
!1367 = !DILocation(line: 454, column: 9, scope: !1364)
!1368 = !DILocation(line: 454, column: 25, scope: !1364)
!1369 = !DILocation(line: 454, column: 42, scope: !1364)
!1370 = !DILocation(line: 453, column: 9, scope: !1325)
!1371 = !DILocation(line: 456, column: 9, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !1364, file: !3, line: 455, column: 5)
!1373 = !DILocation(line: 457, column: 5, scope: !1372)
!1374 = !DILocation(line: 459, column: 12, scope: !1325)
!1375 = !DILocation(line: 459, column: 5, scope: !1325)
!1376 = distinct !DISubprogram(name: "LZ4F_createCDict", scope: !3, file: !3, line: 479, type: !1377, isLocal: false, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!98, !470, !11}
!1379 = !DILocation(line: 481, column: 42, scope: !1376)
!1380 = !DILocation(line: 481, column: 17, scope: !1376)
!1381 = !DILocation(line: 482, column: 39, scope: !1376)
!1382 = !DILocation(line: 482, column: 25, scope: !1376)
!1383 = !DILocation(line: 482, column: 17, scope: !1376)
!1384 = !DILocation(line: 484, column: 10, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1376, file: !3, line: 484, column: 9)
!1386 = !DILocation(line: 484, column: 9, scope: !1376)
!1387 = !DILocation(line: 484, column: 17, scope: !1385)
!1388 = !DILocation(line: 485, column: 9, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1376, file: !3, line: 485, column: 9)
!1390 = !DILocation(line: 485, column: 18, scope: !1389)
!1391 = !DILocation(line: 485, column: 9, scope: !1376)
!1392 = !DILocation(line: 486, column: 22, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1389, file: !3, line: 485, column: 27)
!1394 = !DILocation(line: 486, column: 31, scope: !1393)
!1395 = !DILocation(line: 486, column: 19, scope: !1393)
!1396 = !DILocation(line: 487, column: 18, scope: !1393)
!1397 = !DILocation(line: 488, column: 5, scope: !1393)
!1398 = !DILocation(line: 489, column: 26, scope: !1376)
!1399 = !DILocation(line: 489, column: 5, scope: !1376)
!1400 = !DILocation(line: 489, column: 12, scope: !1376)
!1401 = !DILocation(line: 489, column: 24, scope: !1376)
!1402 = !DILocation(line: 490, column: 22, scope: !1376)
!1403 = !DILocation(line: 490, column: 5, scope: !1376)
!1404 = !DILocation(line: 490, column: 12, scope: !1376)
!1405 = !DILocation(line: 490, column: 20, scope: !1376)
!1406 = !DILocation(line: 491, column: 20, scope: !1376)
!1407 = !DILocation(line: 491, column: 5, scope: !1376)
!1408 = !DILocation(line: 491, column: 12, scope: !1376)
!1409 = !DILocation(line: 491, column: 18, scope: !1376)
!1410 = !DILocation(line: 492, column: 10, scope: !1411)
!1411 = distinct !DILexicalBlock(scope: !1376, file: !3, line: 492, column: 9)
!1412 = !DILocation(line: 492, column: 17, scope: !1411)
!1413 = !DILocation(line: 492, column: 29, scope: !1411)
!1414 = !DILocation(line: 492, column: 33, scope: !1411)
!1415 = !DILocation(line: 492, column: 40, scope: !1411)
!1416 = !DILocation(line: 492, column: 48, scope: !1411)
!1417 = !DILocation(line: 492, column: 52, scope: !1411)
!1418 = !DILocation(line: 492, column: 59, scope: !1411)
!1419 = !DILocation(line: 492, column: 9, scope: !1376)
!1420 = !DILocation(line: 493, column: 24, scope: !1421)
!1421 = distinct !DILexicalBlock(scope: !1411, file: !3, line: 492, column: 66)
!1422 = !DILocation(line: 493, column: 9, scope: !1421)
!1423 = !DILocation(line: 494, column: 9, scope: !1421)
!1424 = !DILocation(line: 496, column: 12, scope: !1376)
!1425 = !DILocation(line: 496, column: 19, scope: !1376)
!1426 = !DILocation(line: 496, column: 32, scope: !1376)
!1427 = !DILocation(line: 496, column: 43, scope: !1376)
!1428 = !DILocation(line: 496, column: 5, scope: !1376)
!1429 = !DILocation(line: 497, column: 19, scope: !1376)
!1430 = !DILocation(line: 497, column: 26, scope: !1376)
!1431 = !DILocation(line: 497, column: 48, scope: !1376)
!1432 = !DILocation(line: 497, column: 55, scope: !1376)
!1433 = !DILocation(line: 497, column: 73, scope: !1376)
!1434 = !DILocation(line: 497, column: 68, scope: !1376)
!1435 = !DILocation(line: 497, column: 5, scope: !1376)
!1436 = !DILocation(line: 498, column: 29, scope: !1376)
!1437 = !DILocation(line: 498, column: 36, scope: !1376)
!1438 = !DILocation(line: 498, column: 5, scope: !1376)
!1439 = !DILocation(line: 499, column: 20, scope: !1376)
!1440 = !DILocation(line: 499, column: 27, scope: !1376)
!1441 = !DILocation(line: 499, column: 47, scope: !1376)
!1442 = !DILocation(line: 499, column: 54, scope: !1376)
!1443 = !DILocation(line: 499, column: 72, scope: !1376)
!1444 = !DILocation(line: 499, column: 67, scope: !1376)
!1445 = !DILocation(line: 499, column: 5, scope: !1376)
!1446 = !DILocation(line: 500, column: 12, scope: !1376)
!1447 = !DILocation(line: 500, column: 5, scope: !1376)
!1448 = !DILocation(line: 501, column: 1, scope: !1376)
!1449 = distinct !DISubprogram(name: "LZ4F_freeCDict", scope: !3, file: !3, line: 503, type: !1450, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{null, !98}
!1452 = !DILocation(line: 505, column: 9, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1449, file: !3, line: 505, column: 9)
!1454 = !DILocation(line: 505, column: 14, scope: !1453)
!1455 = !DILocation(line: 505, column: 9, scope: !1449)
!1456 = !DILocation(line: 505, column: 22, scope: !1453)
!1457 = !DILocation(line: 506, column: 5, scope: !1449)
!1458 = !DILocation(line: 507, column: 20, scope: !1449)
!1459 = !DILocation(line: 507, column: 27, scope: !1449)
!1460 = !DILocation(line: 507, column: 5, scope: !1449)
!1461 = !DILocation(line: 508, column: 22, scope: !1449)
!1462 = !DILocation(line: 508, column: 29, scope: !1449)
!1463 = !DILocation(line: 508, column: 5, scope: !1449)
!1464 = !DILocation(line: 509, column: 5, scope: !1449)
!1465 = !DILocation(line: 510, column: 1, scope: !1449)
!1466 = distinct !DISubprogram(name: "LZ4F_createCompressionContext", scope: !3, file: !3, line: 525, type: !1467, isLocal: false, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!9, !1469, !121}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!1470 = !DILocation(line: 527, column: 48, scope: !1466)
!1471 = !DILocation(line: 527, column: 34, scope: !1466)
!1472 = !DILocation(line: 527, column: 24, scope: !1466)
!1473 = !DILocation(line: 528, column: 9, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1466, file: !3, line: 528, column: 9)
!1475 = !DILocation(line: 528, column: 16, scope: !1474)
!1476 = !DILocation(line: 528, column: 9, scope: !1466)
!1477 = !DILocation(line: 528, column: 31, scope: !1474)
!1478 = !DILocation(line: 528, column: 24, scope: !1474)
!1479 = !DILocation(line: 530, column: 24, scope: !1466)
!1480 = !DILocation(line: 530, column: 5, scope: !1466)
!1481 = !DILocation(line: 530, column: 14, scope: !1466)
!1482 = !DILocation(line: 530, column: 22, scope: !1466)
!1483 = !DILocation(line: 531, column: 5, scope: !1466)
!1484 = !DILocation(line: 531, column: 14, scope: !1466)
!1485 = !DILocation(line: 531, column: 21, scope: !1466)
!1486 = !DILocation(line: 533, column: 62, scope: !1466)
!1487 = !DILocation(line: 533, column: 6, scope: !1466)
!1488 = !DILocation(line: 533, column: 33, scope: !1466)
!1489 = !DILocation(line: 535, column: 5, scope: !1466)
!1490 = !DILocation(line: 536, column: 1, scope: !1466)
!1491 = distinct !DISubprogram(name: "LZ4F_freeCompressionContext", scope: !3, file: !3, line: 539, type: !1492, isLocal: false, isDefinition: true, scopeLine: 540, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!9, !238}
!1494 = !DILocation(line: 541, column: 48, scope: !1491)
!1495 = !DILocation(line: 541, column: 24, scope: !1491)
!1496 = !DILocation(line: 543, column: 9, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1491, file: !3, line: 543, column: 9)
!1498 = !DILocation(line: 543, column: 17, scope: !1497)
!1499 = !DILocation(line: 543, column: 9, scope: !1491)
!1500 = !DILocation(line: 544, column: 8, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1497, file: !3, line: 543, column: 26)
!1502 = !DILocation(line: 545, column: 8, scope: !1501)
!1503 = !DILocation(line: 546, column: 8, scope: !1501)
!1504 = !DILocation(line: 547, column: 5, scope: !1501)
!1505 = !DILocation(line: 549, column: 5, scope: !1491)
!1506 = distinct !DISubprogram(name: "LZ4F_initStream", scope: !3, file: !3, line: 561, type: !1507, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: false, unit: !14, variables: !276)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{null, !90, !209, !86, !189}
!1509 = !DILocation(line: 565, column: 9, scope: !1510)
!1510 = distinct !DILexicalBlock(scope: !1506, file: !3, line: 565, column: 9)
!1511 = !DILocation(line: 565, column: 15, scope: !1510)
